@extends('layouts.app', ['activePage' => 'betDataExport', 'titlePage' => __('Bet Data Export')])

@section('content')
<div class="content">
  <div class="container-fluid">
    <div class="row">
        <div class="col-md-12">
            <div class="container">
                <!-- Input text area -->
                <div class="row mt-3">
                    <div class="col-md-12">
                        <div class="row">
                            <div class="col-md-12 pr-0">
                                <textarea style="border: 1px solid #9c27b0 !important;" id="football" class="w-100 form-control bg-white p-3 border border-danger rounded-top" rows="30" placeholder="Football data">Facebook 
Twitter
 
Twitter
 
Android App
 

MK
 БOJA:  
Заборавив лозинка  
Корисничко име
 
Лозинка
 НАЈАВА
logo
ОБЛОЖУВАЊЕ
ВО ЖИВО
РЕЗУЛТАТИ
АВТОМАТ-КЛУБОВИ
SPORT LIFE КЛУБ
ПРОМОЦИИ
КОНТАКТ
Пребарувај...


Сите
ИСЧИСТИ ПРОЗОРЕЦ
СПОРТОВИ
... Популарни лиги
... Фудбал (237)
... UEFA(32)
... England(60)
... Spain(13)
... Italy(1)
... Germany(4)
... Portugal(8)
... Belgium(8)
... AFC(4)
... CONCACAF(2)
... CONMEBOL(2)
... CAF(4)
... Algeria(2)
... Argentina(13)
... Australia(5)
... Azerbaijan(2)
... Bangladesh(1)
... Brazil(9)
... Bulgaria(8)
... Costa Rica(1)
... Cyprus(7)
... Greece(4)
... India(2)
... Indonesia(2)
... Israel(10)
... Mexico(17)
... Nigeria(1)
... Saudi Arabia(2)
... Scotland(5)
... Switzerland(8)
... Кошарка (65)
... Тенис (58)
... Хокеј (72)
... Ракомет (3)
... Одбојка (14)
... Американски фудбал (1)
... Снукер (17)
... Пикадо (12)
... е-Спортови (13)
... Победник (170)
ВРЕМЕ НА ПОЧЕТОК
...Сите денешни
...Сите утрешни
...НАЈИГРАНИ
...„5 ДО 12“ ОБЛОЗИ
UEFA CHAMPIONS LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
13.02	21:00	6005	
FC Kobenhavn : Manchester City
9.00	5.25	1.32	3.30	1.04	16.3	1.91	2.26	1.63	2.60	2.00	2.40	5.50	1.41	16.3	1.90	+566	
13.02	21:00	6006	
Leipzig RB : Real Madrid
3.25	3.80	2.15	1.72	1.32	5.40	3.30	2.25	1.63	2.60	1.57	1.90	2.45	1.85	4.85	2.95	+572	
14.02	21:00	6002	
Lazio : Bayern München
6.00	4.50	1.49	2.55	1.11	10.8	2.23	2.24	1.64	2.60	1.78	2.15	3.95	1.52	10.0	2.13	+569	
14.02	21:00	6004	
PSG : Real Sociedad
1.72	4.15	4.75	1.16	2.22	2.50	8.50	2.19	1.67	2.70	1.70	2.08	1.63	3.40	2.35	7.75	+572	
20.02	21:00	6001	
Inter : Atl. Madrid
1.90	3.50	4.05	1.22	1.86	3.05	7.00	1.74	2.09	3.85	1.93	2.55	2.08	3.75	3.25	7.50	+569	
20.02	21:00	6003	
PSV : B. Dortmund
2.15	3.70	3.20	1.33	1.69	3.40	5.35	2.22	1.65	2.65	1.57	1.92	1.89	2.45	3.05	4.80	+572	
21.02	21:00	6007	
Porto : Arsenal
4.00	3.70	1.90	1.89	1.22	6.75	2.95	1.92	1.87	3.20	1.78	2.25	3.30	1.91	6.75	2.95	+570	
21.02	21:00	6008	
Napoli : Barcelona
2.85	3.60	2.50	1.57	1.40	4.75	3.80	2.16	1.69	2.70	1.58	1.95	2.30	2.04	4.30	3.45	+572	
UEFA EUROPA LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
15.02	18:45	6021	
Feyenoord : Roma
2.00	3.40	3.80	1.24	1.77	3.25	6.50	1.83	1.97	3.45	1.79	2.35	2.05	3.30	3.25	6.75	+570	
15.02	18:45	6022	
Shakhtar : Marseille
3.15	3.50	2.25	1.64	1.33	5.40	3.60	1.92	1.87	3.20	1.69	2.19	2.75	2.13	5.25	3.50	+570	
15.02	18:45	6023	
Galatasaray : Sparta P.
1.71	3.85	4.70	1.17	2.08	2.70	8.25	1.98	1.82	3.05	1.79	2.26	1.77	3.60	2.65	8.00	+569	
15.02	18:45	6024	
Young Boys : Sporting L.
3.75	3.70	1.92	1.84	1.25	6.25	3.05	2.10	1.73	2.85	1.65	2.06	2.85	1.84	6.00	2.85	+572	
15.02	21:00	6025	
Milan : Rennes
1.62	3.95	5.35	1.13	2.24	2.50	9.25	1.98	1.81	3.05	1.84	2.35	1.70	4.00	2.50	9.25	+568	
15.02	21:00	6026	
Benfica : Toulouse
1.39	4.70	8.00	1.06	2.90	2.07	14.3	2.10	1.73	2.85	1.99	2.45	1.50	5.30	2.07	14.5	+566	
15.02	21:00	6027	
Lens : Freiburg
1.91	3.55	4.00	1.22	1.85	3.05	7.00	1.82	1.97	3.50	1.84	2.40	2.00	3.45	3.15	7.00	+570	
15.02	21:00	6028	
Braga : Qarabag
1.36	4.90	8.25	1.05	3.05	2.00	15.0	2.20	1.66	2.65	1.96	2.40	1.45	5.25	1.97	15.0	+567	
UEFA EUROPA CONFERENCE LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
15.02	21:00	6045	
Servette : Ludogorets
2.25	3.45	3.00	1.35	1.58	3.70	5.05	1.91	1.85	3.20	1.69	2.14	2.16	2.60	3.60	4.90	+569	
15.02	21:00	6830	
Molde : Legia
2.18	3.50	3.10	1.33	1.62	3.55	5.20	1.99	1.77	3.00	1.64	2.05	2.04	2.60	3.35	4.90	+570	
15.02	21:00	6831	
Betis : Dinamo Zagreb
1.70	3.90	4.50	1.17	2.06	2.65	7.75	2.10	1.70	2.80	1.69	2.07	1.69	3.25	2.50	7.25	+570	
15.02	21:00	6832	
Sturm Graz : Slovan Bratislava
1.81	3.65	4.15	1.19	1.92	2.85	7.25	1.93	1.82	3.15	1.75	2.20	1.84	3.30	2.80	7.00	+569	
15.02	21:00	6833	
Union St. Gilloise : Eintracht F.
2.21	3.40	3.10	1.32	1.60	3.65	5.35	1.84	1.92	3.40	1.73	2.23	2.18	2.80	3.60	5.25	+569	
15.02	21:00	6834	
Maccabi Haifa : Gent
2.80	3.50	2.35	1.53	1.39	4.65	3.90	1.99	1.77	3.00	1.63	2.04	2.40	2.16	4.35	3.65	+569	
15.02	21:00	6835	
Olympiakos : Ferencvaros
1.80	3.70	4.15	1.20	1.93	2.85	7.00	1.98	1.78	3.00	1.72	2.15	1.81	3.25	2.75	6.75	+569	
15.02	21:00	6836	
Ajax : Bodo/Glimt
1.61	4.15	4.85	1.15	2.21	2.45	8.25	2.35	1.57	2.45	1.61	1.92	1.55	3.15	2.22	7.25	+570	
UEFA CHAMPIONS LEAGUE (W)	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:45	6271	
Real Madrid (W) : Hacken (W)
1.62	3.85	4.70	1.12	2.08	2.45	8.00	2.04	1.67	2.75	1.68	2.02	1.60	3.30	2.30	7.25	+542	
30.01	18:45	6722	
Paris FC (W) : Chelsea (W)
3.20	3.65	2.04	1.68	1.29	5.30	3.20	2.18	1.62	2.60	1.54	1.89	2.45	1.83	4.80	2.95	+550	
30.01	21:00	6723	
Ajax (W) : Roma (W)
3.15	3.65	2.05	1.67	1.30	5.20	3.25	2.30	1.57	2.45	1.50	1.82	2.35	1.79	4.60	2.85	+552	
30.01	21:00	6728	
Bayern München (W) : PSG (W)
1.86	3.60	3.80	1.21	1.83	2.90	6.25	1.97	1.77	3.00	1.68	2.12	1.84	3.05	2.85	6.25	+550	
31.01	18:45	6704	
Lyon (W) : Slavia P. (W)
1.02	10.3	17.8	-	6.25	1.11	28.5	6.50	1.03	1.22	2.60	-	-	-	-	-	+39	
31.01	18:45	6729	
Brann (W) : St. Polten (W)
1.38	4.65	6.75	1.04	2.70	2.01	11.8	2.35	1.51	2.35	1.70	1.97	1.37	3.85	1.82	10.3	+542	
31.01	21:00	6706	
Benfica (W) : Barcelona (W)
23.5	10.0	1.03	6.75	-	39.0	1.20	3.65	1.20	1.60	3.00	-	-	-	-	-	+40	
31.01	21:00	6730	
Eintracht F. (W) : Rosengard (W)
1.30	5.25	7.50	1.02	3.05	1.84	13.0	2.70	1.39	2.05	1.64	1.83	1.27	3.70	1.62	11.0	+540	
ENGLAND CHAMPIONSHIP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1011	
Coventry : Bristol City
1.87	3.45	4.20	1.19	1.87	3.00	7.25	1.83	1.93	3.40	1.80	2.35	1.93	3.50	3.00	7.25	+569	
30.01	20:45	1012	
Leicester : Swansea
1.33	5.00	9.00	1.03	3.20	1.94	16.0	2.30	1.57	2.45	1.90	2.26	1.38	5.05	1.83	15.5	+564	
31.01	20:45	1013	
Sheffield Wed. : Watford
2.65	3.25	2.70	1.44	1.44	4.45	4.45	1.85	1.91	3.30	1.70	2.20	2.45	2.45	4.30	4.30	+569	
ENGLAND LEAGUE 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1024	
Oxford Utd : Portsmouth
2.85	3.35	2.35	1.52	1.36	4.70	3.80	1.99	1.74	2.90	1.59	2.02	2.40	2.10	4.40	3.55	+569	
ENGLAND LEAGUE 2	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1037	
Sutton Utd : Harrogate Town
2.45	3.30	2.70	1.40	1.47	4.05	4.50	1.87	1.85	3.20	1.66	2.15	2.30	2.45	3.95	4.40	+569	
ENGLAND NATIONAL LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1050	
Solihull Moors : Dag & Red
2.22	3.35	2.95	1.30	1.53	3.55	4.90	1.84	1.83	3.15	1.66	2.08	2.09	2.55	3.40	4.70	+565	
30.01	20:45	1051	
Wealdstone : Aldershot
1.98	3.55	3.30	1.25	1.68	3.10	5.45	2.09	1.64	2.65	1.55	1.86	1.78	2.50	2.80	4.90	+565	
ENGLAND EFL TROPHY	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:00	1094	
Blackpool : Bolton
2.70	3.30	2.45	1.47	1.39	4.50	4.05	1.82	1.90	3.35	1.70	2.22	2.50	2.35	4.50	4.05	+550	
30.01	20:30	1110	
Bradford : Doncaster
1.91	3.45	3.80	1.21	1.78	3.05	6.50	1.82	1.90	3.35	1.76	2.30	1.96	3.25	3.05	6.50	+550	
30.01	20:30	1111	
Peterborough : AFC Wimbledon
1.61	3.85	5.05	1.12	2.16	2.45	8.50	2.06	1.69	2.80	1.71	2.13	1.63	3.55	2.35	8.25	+547	
31.01	20:00	1112	
Wycombe : Brighton U21
1.53	4.15	5.20	1.09	2.26	2.30	8.75	2.30	1.53	2.40	1.60	1.87	1.46	3.20	2.03	7.75	+545	
ENGLAND NATIONAL LEAGUE NORTH	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1063	
Banbury United : Darlington 1883
2.13	3.30	3.10	1.27	1.56	3.40	5.10	1.77	1.86	3.25	1.69	2.14	2.07	2.70	3.40	5.15	+543	
30.01	20:45	1064	
Chorley : Alfreton
2.02	3.50	3.15	1.25	1.62	3.15	5.20	2.01	1.66	2.70	1.56	1.89	1.83	2.45	2.95	4.80	+546	
30.01	20:45	1065	
Hereford : South Shields
2.11	3.40	3.05	1.27	1.57	3.35	5.10	1.85	1.78	3.05	1.64	2.04	1.99	2.60	3.25	4.95	+545	
30.01	20:45	1066	
Scunthorpe : Tamworth
2.02	3.25	3.40	1.22	1.62	3.20	5.70	1.68	1.98	3.55	1.78	2.30	2.08	3.05	3.35	6.00	+541	
ENGLAND NATIONAL LEAGUE SOUTH	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1076	
Yeovil : Slough Town
1.50	3.80	5.55	1.06	2.20	2.21	9.25	1.91	1.70	2.85	1.75	2.17	1.55	3.85	2.23	9.50	+541	
30.01	20:45	1077	
Welling : Hampton & Richmond
2.45	3.15	2.60	1.35	1.40	3.90	4.20	1.76	1.85	3.25	1.64	2.12	2.25	2.35	3.95	4.25	+544	
ENGLAND LEAGUE CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
25.02	17:30	1092	
Chelsea : Liverpool
3.75	3.75	1.92	1.85	1.23	6.25	2.95	2.23	1.62	2.60	1.57	1.90	2.70	1.73	5.70	2.65	+553	
ENGLAND NLP NORTHERN PREMIER	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1090	
Utd of Manchester : Marine
2.90	3.70	2.08	1.59	1.30	4.65	3.25	2.35	1.48	2.25	1.43	1.66	2.09	1.71	4.00	2.80	+549	
ENGLAND NLP SOUTHERN CENTRAL	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1088	
Alvechurch : Royston Town
2.65	3.35	2.30	1.45	1.34	4.25	3.65	1.84	1.77	3.05	1.62	2.02	2.35	2.13	4.20	3.60	+544	
30.01	20:45	1115	
Kettering Town : Bromsgrove
2.25	3.40	2.70	1.33	1.47	3.55	4.30	1.89	1.72	2.90	1.59	1.97	2.05	2.30	3.45	4.20	+546	
30.01	20:45	1116	
Leiston FC : Long Eaton
1.23	5.40	8.75	-	3.25	1.69	14.8	2.55	1.40	2.10	1.73	1.96	1.24	4.30	1.60	13.5	+536	
ENGLAND NLP SOUTHERN SOUTH	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1089	
Hayes & Yeading : Bracknell Town
3.20	3.65	1.91	1.67	1.23	5.25	2.95	2.25	1.50	2.35	1.45	1.72	2.25	1.65	4.55	2.60	+546	
30.01	20:45	1117	
Hendon : AFC Totton
3.35	3.65	1.87	1.71	1.21	5.50	2.90	2.17	1.54	2.45	1.49	1.78	2.40	1.66	4.90	2.60	+546	
30.01	20:45	1118	
Plymouth Parkway : Beaconsfield
1.77	3.80	3.60	1.18	1.80	2.70	5.95	2.30	1.48	2.30	1.46	1.71	1.56	2.40	2.35	5.10	+546	
30.01	20:45	1119	
Poole Town : Salisbury FC
2.05	3.60	2.95	1.28	1.58	3.20	4.75	2.20	1.52	2.40	1.46	1.73	1.74	2.18	2.85	4.20	+547	
30.01	20:45	1120	
Winchester : Tiverton
1.92	3.70	3.15	1.24	1.67	2.95	5.15	2.30	1.48	2.30	1.44	1.69	1.64	2.22	2.60	4.45	+546	
ENGLAND NLP ISTHMIAN	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1087	
Chatham : Hashtag United
1.70	3.95	3.80	1.16	1.88	2.55	6.00	2.40	1.43	2.18	1.44	1.67	1.49	2.40	2.22	5.30	+545	
30.01	20:45	1101	
Cheshunt : Potters Bar Town
2.17	3.60	2.70	1.33	1.51	3.40	4.35	2.26	1.50	2.35	1.44	1.69	1.78	2.04	3.00	3.75	+548	
30.01	20:45	1102	
Concord Rangers : Haringey Borough
1.98	3.60	3.10	1.25	1.63	3.05	5.05	2.13	1.56	2.50	1.49	1.79	1.74	2.30	2.80	4.55	+546	
30.01	20:45	1103	
Dulwich Hamlet : Wingate Finchl
2.01	3.70	2.95	1.27	1.60	3.10	4.80	2.30	1.47	2.25	1.43	1.67	1.68	2.12	2.70	4.10	+547	
30.01	20:45	1104	
Enfield Town : Billericay
3.10	3.45	2.02	1.60	1.25	5.15	3.15	1.90	1.71	2.90	1.60	1.98	2.55	1.89	4.90	3.05	+544	
30.01	20:45	1105	
Folkestone : Hornchurch
5.20	4.15	1.48	2.25	1.07	8.75	2.17	2.22	1.52	2.40	1.60	1.88	3.25	1.44	8.00	2.02	+541	
30.01	20:45	1113	
Hastings Utd. : Margate
1.56	3.95	4.75	1.09	2.10	2.30	8.00	2.07	1.59	2.60	1.63	1.96	1.53	3.20	2.20	7.50	+542	
30.01	20:45	1114	
Lewes : Carshalton
2.02	3.65	2.95	1.27	1.60	3.15	4.75	2.25	1.49	2.35	1.44	1.70	1.70	2.15	2.75	4.15	+547	
ENGLAND PROFESSIONAL DEVELOPMENT LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	14:00	1097	
Bournemouth U21 : Millwall U21
2.00	3.95	2.85	1.30	1.61	3.05	4.55	2.85	1.32	1.90	1.32	1.47	1.53	1.85	2.50	3.60	+362	
30.01	14:00	1121	
Charlton U21 : Swansea U21
3.35	4.40	1.72	1.85	1.21	5.40	2.55	3.75	1.18	1.57	1.22	1.32	1.76	1.30	3.95	1.96	+360	
30.01	15:00	1122	
Cardiff U21 : QPR U21
2.70	4.10	2.02	1.60	1.33	4.30	3.10	3.40	1.22	1.66	1.24	1.35	1.65	1.43	3.20	2.35	+359	
30.01	20:00	1123	
Hull U21 : Wigan U21
2.60	4.00	2.13	1.54	1.36	4.10	3.30	3.00	1.29	1.81	1.28	1.42	1.71	1.54	3.20	2.60	+362	
ENGLAND PREMIER LEAGUE CUP U21	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:00	1099	
Tottenham U21 : Bristol City U21
1.19	5.90	8.50	-	3.40	-	-	3.20	1.24	1.70	-	-	-	-	-	-	+18	
SPAIN LA LIGA	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	19:00	1301	
Barcelona : Osasuna
1.33	4.85	9.00	1.03	3.15	1.99	16.5	2.26	1.63	2.55	1.93	2.30	1.40	5.20	1.87	15.8	+564	
31.01	21:00	1302	
Atl. Madrid : Rayo Vallecano
1.48	4.50	6.75	1.07	2.60	2.25	12.3	2.15	1.70	2.70	1.81	2.22	1.51	4.30	2.09	11.5	+567	
01.02	21:00	1303	
Getafe : Real Madrid
6.25	3.90	1.55	2.40	1.08	11.8	2.40	1.87	1.90	3.25	1.96	2.50	4.80	1.67	12.0	2.40	+564	
02.02	21:00	1304	
Athletic Bilbao : Mallorca
1.50	3.85	7.50	1.07	2.50	2.40	14.0	1.69	2.16	4.00	2.30	3.10	1.78	6.50	2.65	16.8	+563	
03.02	14:00	1305	
Valencia : Almeria
1.66	3.65	5.45	1.13	2.16	2.70	9.75	1.85	1.94	3.35	1.91	2.50	1.79	4.25	2.70	10.0	+567	
03.02	16:15	1306	
Granada : Las Palmas
2.30	3.05	3.30	1.30	1.57	4.00	5.95	1.62	2.30	4.35	1.94	2.75	2.50	3.35	4.30	6.25	+568	
03.02	18:30	1307	
Alaves : Barcelona
5.15	3.70	1.66	2.13	1.13	9.25	2.65	1.95	1.81	3.05	1.79	2.25	3.80	1.72	8.75	2.55	+568	
03.02	21:00	1308	
Girona : Real Sociedad
2.12	3.30	3.55	1.27	1.69	3.55	6.25	1.80	2.00	3.50	1.79	2.40	2.15	3.15	3.50	6.25	+570	
04.02	14:00	1309	
Villarreal : Cadiz
1.66	3.75	5.25	1.14	2.16	2.65	9.50	1.96	1.84	3.10	1.82	2.35	1.74	3.90	2.55	9.25	+568	
04.02	16:15	1310	
Osasuna : Celta
2.35	3.00	3.35	1.30	1.55	4.15	6.00	1.55	2.45	4.80	2.03	2.90	2.70	3.55	4.60	6.75	+567	
04.02	18:30	1361	
Betis : Getafe
1.93	3.20	4.40	1.19	1.83	3.25	8.00	1.61	2.30	4.40	2.05	2.85	2.21	4.25	3.55	9.00	+567	
04.02	21:00	1362	
Real Madrid : Atl. Madrid
1.71	3.85	4.70	1.17	2.09	2.70	8.25	2.23	1.65	2.60	1.64	2.02	1.65	3.15	2.45	7.25	+572	
05.02	21:00	1363	
Rayo Vallecano : Sevilla
2.23	3.15	3.45	1.29	1.62	3.80	6.00	1.68	2.18	4.00	1.89	2.60	2.35	3.30	3.95	6.25	+568	
GERMANY GERMANY DFB POKAL	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1898	
St. Pauli : F. Düsseldorf
1.80	3.85	4.05	1.20	1.95	2.80	7.00	2.20	1.65	2.65	1.62	1.96	1.70	2.95	2.55	6.25	+572	
31.01	20:45	2845	
Hertha : Kaiserslautern
2.06	3.65	3.25	1.30	1.70	3.30	5.50	2.20	1.65	2.65	1.56	1.89	1.85	2.50	2.95	4.90	+572	
06.02	20:45	2852	
B. Leverkusen : Stuttgart
1.68	4.10	4.55	1.17	2.13	2.55	7.75	2.40	1.55	2.40	1.58	1.86	1.56	2.95	2.26	6.75	+572	
07.02	20:45	2853	
Saarbrucken : Monchengladbach
3.60	3.65	1.95	1.79	1.25	6.00	3.10	2.10	1.70	2.75	1.61	1.98	2.75	1.82	5.65	2.85	+571	
PORTUGAL PRIMEIRA LIGA	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	19:45	1544	
Rio Ave : Estoril
2.22	3.25	3.25	1.30	1.60	3.70	5.65	1.84	1.92	3.35	1.71	2.23	2.16	2.85	3.55	5.50	+569	
31.01	21:45	1543	
Braga : Chaves
1.28	5.35	9.75	1.02	3.40	1.86	17.3	2.45	1.52	2.35	1.89	2.21	1.34	5.10	1.74	16.3	+564	
PORTUGAL SEGUNDA LIGA	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	21:15	1554	
Academico Viseu : Tondela
2.26	3.00	3.25	1.26	1.52	3.75	5.60	1.57	2.22	4.20	1.88	2.55	2.40	3.15	4.00	6.00	+540	
PORTUGAL LIGA REVELACAO U23	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	12:00	2834	
Sporting L. U23 : Benfica U23
2.03	3.65	2.95	1.28	1.59	3.20	4.85	2.19	1.53	2.45	1.47	1.74	1.74	2.20	2.80	4.20	+361	
30.01	16:00	2836	
Famalicao U23 : Torreense U23
1.75	3.45	4.10	1.13	1.83	2.75	7.00	1.80	1.80	3.10	1.71	2.16	1.77	3.25	2.70	7.00	+361	
30.01	16:00	2837	
Vizela U23 : Estrela U23
2.07	3.45	3.00	1.27	1.57	3.30	5.00	1.90	1.71	2.90	1.59	1.97	1.92	2.50	3.15	4.70	+361	
30.01	16:00	2838	
CD Mafra U23 : Leixoes U23
2.35	3.40	2.60	1.35	1.44	3.80	4.30	1.87	1.74	2.95	1.59	1.98	2.11	2.30	3.60	4.05	+360	
30.01	17:00	2839	
Estoril U23 : Gil Vicente U23
1.84	3.70	3.40	1.20	1.74	2.85	5.70	2.40	1.45	2.20	1.42	1.66	1.57	2.25	2.40	4.75	+360	
AFC ASIAN CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	12:30	5607	
Uzbekistan : Thailand
1.62	3.55	5.60	1.10	2.13	2.60	10.0	1.65	2.13	4.00	2.08	2.80	1.88	5.00	2.85	11.5	+543	
30.01	17:00	5608	
Saudi Arabia : South Korea
4.70	3.40	1.77	1.94	1.14	8.25	2.85	1.71	2.05	3.75	1.92	2.60	4.10	1.93	9.00	2.95	+547	
31.01	12:30	5609	
Bahrain : Japan
12.8	6.00	1.21	4.05	-	22.5	1.68	2.25	1.58	2.50	2.30	2.65	7.25	1.31	23.5	1.70	+539	
31.01	17:00	5623	
Iran : Syria
1.32	4.50	9.75	1.01	3.05	1.99	17.8	1.78	1.95	3.50	2.40	3.10	1.55	7.75	2.19	21.0	+541	
CONCACAF NATIONS LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
22.03	01:00	5105	
USA : Jamaica
1.35	4.45	8.00	1.01	2.80	1.99	14.5	1.82	1.85	3.25	2.16	2.70	1.51	6.00	2.09	16.0	+539	
22.03	04:15	5604	
Panama : Mexico
5.80	3.50	1.59	2.13	1.07	10.3	2.50	1.57	2.21	4.25	2.17	2.90	5.40	1.86	12.0	2.80	+538	
CONMEBOL OLYMPIC GAMES QUAL.	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	21:00	5627	
Uruguay U23 : Peru U23
1.68	3.65	4.55	1.13	1.98	2.60	7.75	1.85	1.82	3.15	1.77	2.21	1.73	3.55	2.55	7.50	+541	
31.01	00:00	5602	
Chile U23 : Argentina U23
5.65	3.90	1.53	2.24	1.08	9.75	2.35	1.85	1.82	3.15	1.87	2.35	4.25	1.63	9.75	2.30	+540	
CAF AFRICA CUP OF NATIONS	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:00	5621	
Mali : Burkina Faso
2.30	2.80	3.45	1.25	1.53	3.95	6.00	1.37	2.95	6.25	2.30	3.55	3.00	4.30	5.20	8.25	+542	
30.01	21:00	5622	
Morocco : South Africa
1.60	3.45	6.25	1.07	2.22	2.50	11.8	1.52	2.40	4.80	2.35	3.35	1.96	6.50	3.00	15.3	+540	
02.02	18:00	5151	
Nigeria : Angola
1.73	3.20	5.60	1.10	2.00	2.75	10.0	1.45	2.60	5.40	2.40	3.50	2.18	6.00	3.45	13.5	+540	
02.02	21:00	5630	
DR Congo : Guinea
2.60	2.85	3.05	1.34	1.42	4.50	5.05	1.40	2.80	6.00	2.21	3.35	3.25	3.55	5.80	6.50	+543	
ALGERIA LIGUE 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:00	5241	
CR Belouizdad : MC Oran
1.41	3.75	8.25	-	2.55	2.25	15.8	1.53	2.24	4.30	2.50	3.35	1.71	7.75	2.55	20.0	+530	
31.01	18:00	5631	
USM Alger : Constantine
1.74	3.25	4.60	1.11	1.86	2.90	8.25	1.55	2.20	4.20	2.03	2.75	2.00	4.40	3.10	9.25	+536	
ARGENTINA COPA DE LA LIGA PROFESIONAL	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	21:00	4201	
Gimnasia LP : Independiente Riv.
1.97	3.05	4.20	1.18	1.73	3.25	7.25	1.42	2.70	5.70	2.30	3.40	2.50	4.85	4.15	9.75	+562	
30.01	23:15	4202	
Huracan : Talleres Cordoba
2.22	2.95	3.45	1.25	1.57	3.70	6.00	1.44	2.65	5.50	2.17	3.20	2.70	4.00	4.60	7.50	+564	
30.01	23:15	4203	
Rosario Central : Banfield
2.30	2.85	3.40	1.26	1.53	3.90	6.00	1.39	2.80	6.00	2.25	3.40	2.90	4.15	5.05	7.75	+562	
31.01	01:30	4204	
Lanus : Newell' Old B.
2.50	2.85	3.10	1.31	1.46	4.25	5.35	1.37	2.90	6.25	2.30	3.50	3.20	3.90	5.65	7.25	+562	
31.01	01:30	4205	
Velez Sarsfield : Independiente
2.45	2.80	3.20	1.29	1.47	4.20	5.65	1.34	3.10	6.75	2.40	3.75	3.30	4.20	5.80	7.75	+561	
31.01	21:00	4206	
Argentinos J. : Dep. Riestra
1.76	3.15	5.15	1.12	1.93	2.85	9.25	1.45	2.60	5.40	2.35	3.40	2.24	5.70	3.55	12.3	+560	
31.01	21:00	4207	
Defensa y Justicia : Platense
2.20	3.00	3.50	1.25	1.58	3.65	6.00	1.45	2.60	5.45	2.16	3.15	2.70	4.00	4.55	7.50	+564	
31.01	23:15	4208	
Belgrano : San Lorenzo
2.50	2.80	3.20	1.29	1.46	4.25	5.60	1.34	3.05	6.75	2.35	3.70	3.30	4.15	5.85	7.75	+561	
01.02	00:00	4209	
Racing Club : Tigre
1.85	3.20	4.45	1.16	1.84	3.00	7.75	1.50	2.45	5.00	2.18	3.10	2.26	4.75	3.60	9.75	+562	
01.02	01:30	4210	
Barracas Central : River Plate
5.90	3.65	1.58	2.22	1.09	10.3	2.45	1.68	2.09	3.90	2.09	2.80	5.15	1.82	12.0	2.70	+563	
01.02	23:00	4822	
Boca Juniors : Sarmiento
1.70	3.30	5.60	1.10	2.05	2.70	10.0	1.50	2.45	5.00	2.30	3.30	2.09	5.90	3.25	13.0	+559	
02.02	01:30	4829	
Central Córdoba : Godoy Cruz
3.35	2.95	2.30	1.55	1.27	5.85	3.80	1.44	2.65	5.50	2.16	3.20	3.85	2.80	7.25	4.75	+564	
02.02	01:30	4834	
Union Santa Fe : Estudiantes
2.80	2.90	2.65	1.41	1.37	4.80	4.55	1.40	2.80	6.00	2.23	3.35	3.45	3.35	6.25	5.95	+563	
AUSTRALIA A-LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
02.02	09:45	3060	
Brisbane Roar : Wellington Phoenix
2.30	3.65	2.80	1.38	1.57	3.65	4.60	2.45	1.52	2.30	1.45	1.72	1.84	2.08	3.10	3.90	+573	
02.02	11:45	3061	
Perth Glory : Melbourne City
4.10	4.00	1.75	1.99	1.20	6.75	2.65	2.65	1.45	2.14	1.46	1.69	2.50	1.53	5.65	2.25	+572	
03.02	07:00	3062	
Western United FC : Sydney FC
3.70	3.95	1.84	1.89	1.24	6.00	2.80	2.75	1.43	2.09	1.42	1.64	2.30	1.55	5.05	2.35	+572	
03.02	08:00	3063	
Newcastle Jets : Melbourne Victory
3.55	3.70	1.93	1.79	1.25	6.00	3.00	2.35	1.57	2.45	1.52	1.82	2.50	1.72	5.20	2.65	+572	
03.02	09:45	3064	
Adelaide United : Central Coast
2.25	3.85	2.75	1.41	1.57	3.60	4.40	2.90	1.38	1.98	1.35	1.55	1.69	1.86	2.90	3.50	+573	
AZERBAIJAN CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	12:00	3555	
Sabail : Zira
2.75	3.00	2.45	1.41	1.33	4.80	4.20	1.47	2.40	4.80	2.00	2.75	3.05	2.80	5.55	4.85	+537	
30.01	16:00	3613	
Sabah FC : Qarabag
5.20	3.90	1.54	2.17	1.08	9.00	2.40	1.88	1.76	3.00	1.80	2.21	3.85	1.61	9.00	2.35	+540	
BANGLADESH FEDERATION CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	09:45	5212	
Chittagong Abahani : Abahani Limited
6.50	4.30	1.38	2.55	1.03	11.3	2.04	2.11	1.57	2.55	1.74	2.08	4.00	1.41	10.8	1.94	+359	
BRAZIL BRAZIL CARIOCA	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	01:30	4806	
Botafogo RJ : Portuguesa RJ
1.41	4.00	7.75	1.02	2.55	2.14	14.0	1.65	2.07	3.90	2.30	3.00	1.65	6.50	2.35	16.3	+535	
BRAZIL BRAZIL PAULISTA	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	23:30	4267	
Corinthians : Sao Paulo
2.95	3.00	2.40	1.46	1.31	5.05	4.00	1.46	2.50	5.10	2.06	2.90	3.30	2.80	5.95	4.70	+538	
31.01	23:30	4800	
RB Bragantino : Palmeiras
2.90	3.15	2.35	1.47	1.32	4.90	3.90	1.60	2.15	4.10	1.86	2.50	2.90	2.45	5.20	4.15	+540	
31.01	23:30	4807	
Portuguesa Desportos : Ponte Preta
2.40	3.20	2.80	1.34	1.45	4.00	4.70	1.59	2.17	4.15	1.88	2.50	2.55	2.85	4.30	5.05	+540	
01.02	01:35	4808	
EC Agua Santa : Santos
4.25	3.45	1.78	1.86	1.15	7.25	2.80	1.73	1.96	3.50	1.83	2.35	3.60	1.88	7.50	2.85	+541	
01.02	01:35	4809	
Guarani SP : Mirassol
2.50	3.05	2.75	1.35	1.42	4.20	4.70	1.54	2.25	4.40	1.92	2.60	2.70	2.90	4.60	5.15	+541	
01.02	23:00	4810	
Botafogo SP : Santo Andre
1.97	3.15	3.80	1.19	1.69	3.20	6.50	1.54	2.30	4.45	2.00	2.70	2.23	3.80	3.55	7.50	+541	
01.02	23:00	4811	
Inter Limeira : EC Sao Bernardo
2.90	3.05	2.40	1.46	1.32	4.95	4.00	1.57	2.20	4.20	1.88	2.55	2.95	2.50	5.30	4.25	+540	
01.02	23:00	4818	
Gremio Novorizontino : Ituano
1.80	3.25	4.45	1.13	1.84	2.90	7.75	1.53	2.30	4.50	2.08	2.85	2.09	4.40	3.25	9.00	+538	
BULGARIA BULGARIA 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
16.02	16:30	3153	
Hebar : Lokomotiv Sofia
2.40	3.00	3.00	1.30	1.46	3.90	5.00	1.47	2.45	4.95	2.03	2.85	2.70	3.30	4.60	6.00	+539	
17.02	11:15	3156	
FK Krumovgrad : Botev Plovdiv
5.60	3.70	1.57	2.17	1.08	9.50	2.35	1.70	1.99	3.65	2.00	2.60	4.70	1.74	10.5	2.55	+539	
17.02	13:45	3155	
Slavia Sofia : Beroe
1.77	3.35	4.50	1.13	1.87	2.75	7.50	1.59	2.18	4.15	2.01	2.70	2.00	4.25	3.05	8.75	+538	
17.02	16:15	3151	
Pirin B. : Levski Sofia
6.25	3.75	1.50	2.30	1.05	11.0	2.24	1.64	2.09	3.90	2.16	2.85	5.65	1.73	13.3	2.50	+537	
18.02	11:45	3158	
Etar V.Trnovo : CSKA 1948 Sofia
5.85	3.70	1.55	2.21	1.07	10.0	2.30	1.67	2.04	3.75	2.06	2.70	5.00	1.75	11.5	2.55	+538	
18.02	14:15	3152	
Arda : Lokomotiv Plovdiv
2.50	3.00	2.80	1.33	1.43	4.05	4.65	1.51	2.35	4.65	1.96	2.70	2.75	3.00	4.65	5.40	+539	
18.02	16:45	3157	
CSKA Sofia : Botev Vratsa
1.06	9.00	26.0	-	6.50	1.35	42.0	2.70	1.39	2.05	2.65	2.90	1.13	11.3	1.35	45.0	+527	
19.02	15:00	3154	
Ludogorets : Cerno More
1.51	4.00	5.70	1.07	2.30	2.22	9.50	1.94	1.74	2.95	1.81	2.22	1.57	4.05	2.21	9.50	+541	
COSTA RICA PRIMERA DIVISIÓN	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
01.02	22:00	4761	
Guanacasteca : Municipal Liberia
1.88	3.45	3.80	1.19	1.76	2.95	6.25	1.89	1.78	3.05	1.67	2.08	1.83	2.95	2.80	6.00	+542	
CYPRUS DIVISION 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:00	1581	
Zakakiou : Anorthosis F.
6.50	4.25	1.43	2.50	1.05	11.3	2.12	2.17	1.59	2.55	1.73	2.05	3.90	1.43	10.3	1.94	+543	
30.01	18:00	1582	
APOEL Nicosia : Karmiotissa
1.17	6.00	14.3	-	4.20	1.63	24.5	2.30	1.52	2.35	2.18	2.50	1.25	7.25	1.57	25.0	+535	
31.01	18:00	1583	
AEK Larnaca : Omonia Nicosia
1.69	3.55	4.70	1.12	1.97	2.65	8.00	1.83	1.84	3.15	1.78	2.23	1.74	3.60	2.55	8.00	+541	
31.01	18:00	1584	
Aris Limassol : Othellos Athienou
1.18	6.00	12.8	-	4.10	1.63	22.0	2.55	1.44	2.15	1.98	2.24	1.22	5.95	1.51	21.0	+533	
31.01	18:00	1585	
Paphos : Apollon Limassol
1.85	3.30	4.15	1.16	1.79	2.95	7.00	1.67	2.03	3.70	1.85	2.45	1.97	3.60	3.05	7.50	+540	
01.02	18:00	1588	
AEL Limassol : Nea Salamis
2.30	3.15	3.00	1.30	1.51	3.75	5.05	1.77	1.91	3.35	1.69	2.17	2.18	2.65	3.60	4.90	+546	
01.02	18:00	1589	
Doxa Katokopia : Ethnikos Achna
3.00	3.25	2.25	1.52	1.30	5.05	3.65	1.84	1.83	3.15	1.65	2.08	2.55	2.09	4.75	3.45	+546	
GREECE CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:00	1985	
Niki Volou : Aris
5.40	3.70	1.55	2.15	1.07	9.75	2.45	1.80	1.85	3.20	1.86	2.35	4.15	1.65	9.75	2.40	+539	
31.01	16:00	2830	
Panaitolikos : OFI
2.55	2.90	2.70	1.33	1.37	4.35	4.70	1.54	2.16	4.10	1.82	2.50	2.60	2.75	4.60	4.95	+537	
31.01	18:00	2831	
Atromitos : Panathinaikos
5.75	3.70	1.55	2.20	1.07	10.3	2.45	1.82	1.85	3.20	1.87	2.35	4.30	1.65	10.3	2.35	+540	
31.01	20:00	2832	
PAOK : Panserraikos
1.17	5.90	13.8	-	4.05	1.58	24.5	2.30	1.50	2.30	2.11	2.45	1.24	6.75	1.58	24.0	+534	
INDIA SUPER LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	15:00	5222	
Jamshedpur : NorthEast United
1.91	3.55	3.55	1.21	1.73	3.00	6.00	2.08	1.64	2.65	1.56	1.88	1.74	2.60	2.65	5.30	+546	
01.02	15:00	5601	
Hyderabad FC : Goa
8.00	4.50	1.34	2.85	1.01	14.3	1.98	2.04	1.67	2.75	1.93	2.35	5.10	1.42	14.3	1.91	+540	
INDONESIA LIGA 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	09:00	5632	
Persebaya Surabaya : PSIS Semarang
2.18	3.45	2.95	1.31	1.55	3.50	4.90	1.88	1.79	3.10	1.65	2.04	2.05	2.50	3.30	4.60	+546	
30.01	13:00	5228	
Persis Solo : Madura United
2.35	3.45	2.70	1.37	1.48	3.80	4.45	1.89	1.78	3.05	1.64	2.02	2.15	2.35	3.60	4.15	+546	
ISRAEL LIGAT HA AL - L1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	18:00	1933	
Ashdod : Maccabi Bnei Raina
2.40	3.10	2.95	1.33	1.50	3.95	5.05	1.61	2.20	4.20	1.89	2.60	2.55	3.05	4.35	5.60	+567	
30.01	18:45	1934	
Maccabi Netanya : Bnei Sakhnin
1.86	3.45	4.00	1.19	1.83	2.95	6.75	1.78	1.95	3.50	1.81	2.40	1.96	3.45	3.05	7.25	+567	
30.01	19:00	1935	
Beitar J. : Hapoel P.T.
1.66	3.75	4.80	1.14	2.08	2.55	8.25	1.95	1.78	3.00	1.76	2.22	1.71	3.60	2.55	8.00	+566	
31.01	18:00	1936	
Maccabi P.T. : Hapoel Hadera
2.35	3.15	2.95	1.33	1.51	3.90	5.00	1.66	2.11	3.95	1.83	2.50	2.45	2.90	4.15	5.40	+568	
31.01	18:45	1937	
Hapoel Haifa : Hapoel T.A.
2.06	3.30	3.45	1.26	1.66	3.35	5.90	1.75	1.98	3.55	1.79	2.35	2.13	3.10	3.45	6.00	+568	
31.01	19:00	1938	
Maccabi T.A. : Hapoel Jerusalem
1.28	4.95	10.5	1.01	3.35	1.85	18.5	2.00	1.74	2.95	2.22	2.75	1.43	7.00	1.94	20.8	+560	
31.01	19:30	1939	
Hapoel B. Sheva : Maccabi Haifa
2.75	3.35	2.40	1.49	1.38	4.60	3.95	1.87	1.86	3.20	1.67	2.16	2.50	2.25	4.50	3.85	+569	
ISRAEL LIGA ALEF NORTH - L3	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	13:00	7296	
Tzeirei Kfar Kanna : Tzeirey Umm al-Fahm
3.50	3.25	1.95	1.64	1.19	-	-	1.78	1.82	3.15	-	-	-	-	-	-	+20	
30.01	14:00	7297	
Hapoel Migdal Haemek : Maccabi Ahi Naz.
2.40	3.20	2.65	1.34	1.42	-	-	1.80	1.80	3.10	-	-	-	-	-	-	+20	
ISRAEL LIGA ALEF SOUTH - L3	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	17:30	1943	
Hapoel Lod : Maccabi Ironi Ashdod
2.80	3.10	2.30	1.45	1.30	-	-	1.70	1.92	3.40	-	-	-	-	-	-	+19	
MEXICO LIGA MX	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	02:00	4351	
Cruz Azul : Tijuana
1.71	3.65	4.65	1.15	2.01	2.65	8.00	1.94	1.78	3.00	1.74	2.21	1.74	3.50	2.60	7.75	+566	
31.01	02:00	4352	
Mazatlan FC : Club Leon
3.15	3.40	2.15	1.61	1.30	5.25	3.45	2.02	1.72	2.85	1.59	2.00	2.55	1.97	4.90	3.20	+570	
31.01	04:00	4353	
Santos Laguna : Puebla
1.76	3.80	4.10	1.19	1.94	2.70	6.75	2.30	1.57	2.45	1.55	1.87	1.63	2.75	2.45	6.00	+572	
31.01	04:05	4354	
Guadalajara Chivas : Toluca
2.06	3.40	3.35	1.27	1.66	3.30	5.65	1.97	1.76	2.95	1.63	2.07	1.95	2.70	3.15	5.35	+570	
01.02	02:00	4355	
Pachuca : Atlas
1.91	3.40	3.85	1.21	1.78	3.05	6.50	1.88	1.84	3.15	1.71	2.22	1.91	3.15	3.00	6.50	+569	
01.02	04:00	4356	
Pumas UNAM : Necaxa
1.76	3.60	4.35	1.17	1.94	2.75	7.25	1.95	1.77	3.00	1.71	2.17	1.77	3.30	2.65	7.25	+568	
MEXICO MEXICO 2	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
31.01	04:05	4372	
Cimarrones de Sonora : Tlaxcala
1.45	4.15	6.00	1.06	2.45	2.17	10.8	2.03	1.68	2.75	1.80	2.17	1.50	4.15	2.07	10.3	+542	
01.02	00:05	4373	
Atlante : Alebrijes Oaxaca
1.36	4.45	7.75	1.02	2.75	2.01	13.5	2.00	1.70	2.80	1.94	2.35	1.45	5.05	1.96	13.5	+540	
01.02	02:05	4374	
Dorados : Venados Merida
3.85	3.70	1.80	1.84	1.18	6.25	2.80	2.10	1.63	2.65	1.58	1.89	2.75	1.68	5.75	2.50	+546	
01.02	04:05	4375	
Correcaminos : Cancun FC
2.30	3.25	2.95	1.31	1.50	3.75	4.95	1.73	1.96	3.50	1.74	2.24	2.24	2.70	3.70	4.90	+546	
02.02	02:05	4376	
CD Tapatio : Atletico La Paz
2.04	3.50	3.20	1.26	1.63	3.25	5.35	2.03	1.68	2.75	1.57	1.91	1.85	2.50	2.95	4.80	+546	
02.02	04:05	4377	
Mineros da Zacatecas : Leones Negros
1.93	3.60	3.40	1.23	1.72	3.00	5.70	2.15	1.60	2.55	1.54	1.83	1.73	2.50	2.65	4.95	+546	
MEXICO MEXICO LIGA MX FEMENIL	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
01.02	22:45	4392	
Cruz Azul (W) : Tigres UANL (W)
11.0	5.35	1.20	3.55	-	19.5	1.70	2.14	1.56	2.50	2.06	2.45	6.25	1.29	20.0	1.69	+533	
MEXICO MEXICO U23 LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	16:00	4393	
Cruz Azul U23 : Tijuana U23
1.94	3.30	3.50	1.19	1.65	-	-	1.77	1.84	3.20	-	-	-	-	-	-	+20	
30.01	16:00	4801	
Chivas Guadalajara U23 : Toluca U23
1.82	3.35	3.85	1.16	1.75	-	-	1.79	1.82	3.15	-	-	-	-	-	-	+20	
30.01	17:00	4802	
Mazatlan FC U23 : Club Leon U23
2.50	3.15	2.55	1.36	1.38	-	-	1.73	1.87	3.30	-	-	-	-	-	-	+19	
30.01	18:00	4803	
Santos Laguna U23 : Puebla U23
1.90	3.35	3.55	1.19	1.68	-	-	1.83	1.77	3.05	-	-	-	-	-	-	+20	
NIGERIA PFL	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	16:00	5310	
Rivers United : Enyimba
1.45	3.35	6.50	-	2.20	-	-	1.42	2.35	4.65	-	-	-	-	-	-	+18	
SAUDI ARABIA SAUDI ARABIA 2	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	13:50	4804	
Al-Bukayriyah FC : Al-Ain (SAU)
1.91	3.00	4.00	1.14	1.67	3.25	7.25	1.50	2.25	4.40	1.97	2.75	2.16	3.90	3.50	8.00	+357	
30.01	13:50	4805	
Al Jabalain : Al Qaisoma
1.36	4.25	7.25	1.01	2.60	2.09	13.0	2.04	1.61	2.60	1.81	2.19	1.41	4.45	1.94	12.3	+359	
SCOTLAND PREMIER LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1241	
Livingston : Ross County
2.45	3.10	2.95	1.36	1.49	4.00	4.85	1.60	2.30	4.40	1.94	2.65	2.65	3.10	4.60	5.65	+569	
30.01	20:45	1242	
Aberdeen : Dundee FC
1.73	3.65	4.65	1.16	2.02	2.60	7.75	1.87	1.89	3.30	1.83	2.35	1.82	3.75	2.75	8.25	+568	
SCOTLAND LEAGUE 2	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1260	
East Fife : Spartans F.C.
2.75	3.25	2.35	1.45	1.34	4.50	3.80	1.79	1.85	3.20	1.66	2.10	2.45	2.20	4.45	3.75	+564	
30.01	20:45	1261	
Elgin : Clyde
2.90	3.35	2.19	1.52	1.30	4.80	3.50	1.88	1.76	2.95	1.61	2.00	2.45	2.02	4.60	3.35	+564	
SCOTLAND FA CUP	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:45	1265	
Brora Rangers : Cove Rangers
4.65	4.00	1.63	2.12	1.15	7.75	2.45	2.20	1.61	2.60	1.64	1.99	3.15	1.60	7.25	2.30	+548	
SWITZERLAND SUPER LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:30	1921	
Young Boys : Yverdon
1.41	4.60	6.25	1.07	2.65	2.06	11.0	2.50	1.50	2.25	1.64	1.94	1.39	3.60	1.88	9.75	+567	
30.01	20:30	1922	
Winterthur : Basel
2.45	3.40	2.80	1.39	1.52	3.95	4.75	2.10	1.70	2.75	1.56	1.94	2.06	2.30	3.55	4.25	+571	
31.01	20:30	1923	
Lugano : Grasshoppers
1.76	3.80	4.25	1.19	1.98	2.75	7.25	2.30	1.58	2.50	1.56	1.88	1.63	2.85	2.45	6.25	+572	
31.01	20:30	2843	
St. Gallen : Servette
2.05	3.70	3.25	1.30	1.70	3.25	5.45	2.45	1.51	2.30	1.46	1.73	1.72	2.25	2.75	4.55	+572	
31.01	20:30	2844	
Zurich : Lausanne
1.81	3.60	4.20	1.19	1.91	2.90	7.25	2.05	1.76	2.85	1.67	2.08	1.77	3.10	2.70	6.75	+570	
01.02	20:30	2848	
Lausanne Ouchy : Luzern
2.95	3.55	2.25	1.59	1.36	4.90	3.65	2.30	1.57	2.45	1.49	1.79	2.20	1.87	4.20	3.15	+572	
SWITZERLAND CHALLENGE LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	19:30	1926	
Wil : Schaffhausen
1.75	3.75	4.05	1.17	1.89	2.75	6.75	2.06	1.65	2.70	1.62	1.94	1.67	2.90	2.45	6.00	+563	
30.01	20:15	1927	
Baden : Aarau
3.85	3.85	1.76	1.89	1.18	6.50	2.70	2.30	1.52	2.35	1.51	1.75	2.55	1.58	5.45	2.30	+567	
ENGLAND PREMIER LEAGUE	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:30	1001	
Nottingham Forest : Arsenal
7.50	4.75	1.42	2.85	1.05	13.5	2.06	2.19	1.64	2.65	1.88	2.25	4.75	1.46	13.3	1.98	+566	
30.01	20:45	1002	
Fulham : Everton
2.50	3.35	2.85	1.39	1.53	4.05	4.90	1.86	1.96	3.45	1.75	2.30	2.35	2.65	4.05	4.90	+569	
30.01	20:45	1003	
Luton : Brighton
4.55	4.00	1.72	2.10	1.17	7.75	2.60	2.30	1.61	2.45	1.59	1.90	3.00	1.59	6.75	2.30	+572	
30.01	21:00	1004	
Crystal Palace : Sheffield Utd
1.68	3.70	5.50	1.13	2.17	2.65	9.75	1.75	2.10	3.75	2.04	2.70	1.87	4.75	2.80	10.8	+567	
30.01	21:15	1005	
Aston Villa : Newcastle
1.93	3.90	3.60	1.25	1.84	2.95	6.00	2.45	1.55	2.30	1.49	1.76	1.66	2.45	2.55	5.15	+572	
31.01	20:30	1006	
Tottenham : Brentford
1.67	4.20	4.70	1.17	2.19	2.50	8.00	2.55	1.50	2.25	1.54	1.82	1.52	2.85	2.20	6.75	+572	
31.01	20:30	1007	
Manchester City : Burnley
1.12	9.00	21.5	-	6.25	1.41	36.0	3.15	1.35	1.86	2.30	2.45	1.13	7.75	1.35	35.0	+553	
31.01	21:15	1008	
Liverpool : Chelsea
1.61	4.40	5.05	1.15	2.30	2.40	8.50	2.70	1.46	2.15	1.55	1.79	1.46	2.90	2.07	7.25	+572	
01.02	20:30	1009	
West Ham Utd : Bournemouth
2.50	3.65	2.70	1.44	1.53	3.95	4.45	2.25	1.62	2.55	1.53	1.86	2.02	2.16	3.50	3.95	+573	
01.02	21:15	1010	
Wolverhampton : Manchester Utd
2.75	3.55	2.50	1.51	1.45	4.40	4.10	2.16	1.71	2.70	1.57	1.94	2.22	2.12	4.00	3.70	+573	
03.02	13:30	1125	
Everton : Tottenham
2.70	3.60	2.40	1.52	1.41	4.50	3.90	2.22	1.63	2.60	1.53	1.85	2.18	2.01	3.95	3.45	+572	
03.02	16:00	1126	
Brighton : Crystal Palace
1.61	3.95	5.15	1.13	2.21	2.50	9.00	2.10	1.70	2.80	1.73	2.12	1.63	3.60	2.35	8.50	+568	
03.02	16:00	1127	
Burnley : Fulham
3.00	3.40	2.30	1.56	1.35	5.05	3.80	1.89	1.86	3.20	1.69	2.16	2.65	2.18	4.90	3.65	+569	
03.02	16:00	1128	
Newcastle : Luton
1.37	4.90	7.25	1.06	2.90	2.01	13.0	2.50	1.51	2.30	1.73	2.02	1.38	4.05	1.84	11.8	+567	
03.02	18:30	1129	
Sheffield Utd : Aston Villa
5.20	4.15	1.58	2.25	1.13	9.00	2.40	2.30	1.59	2.50	1.65	1.98	3.35	1.55	8.00	2.20	+570	
04.02	15:00	1130	
Bournemouth : Nottingham Forest
1.76	3.80	4.25	1.19	1.98	2.75	7.25	2.13	1.68	2.75	1.65	2.02	1.71	3.05	2.55	6.75	+571	
04.02	15:00	1131	
Chelsea : Wolverhampton
1.60	4.00	5.15	1.13	2.22	2.45	9.00	2.14	1.67	2.70	1.71	2.08	1.61	3.50	2.30	8.25	+569	
04.02	15:00	1132	
Manchester Utd : West Ham Utd
1.72	3.90	4.35	1.18	2.03	2.70	7.50	2.22	1.63	2.60	1.62	1.95	1.65	3.00	2.45	6.75	+572	
04.02	17:30	1133	
Arsenal : Liverpool
2.07	3.75	3.25	1.32	1.72	3.30	5.45	2.35	1.59	2.45	1.53	1.85	1.81	2.40	2.90	4.75	+572	
05.02	21:00	1134	
Brentford : Manchester City
7.25	4.80	1.38	2.85	1.06	12.8	2.04	2.40	1.54	2.40	1.75	2.06	4.15	1.41	11.8	1.88	+567	
BELGIUM DIVISION 1	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
30.01	20:30	1655	
Club Brugge : Kortrijk
1.13	8.00	18.0	-	5.55	1.45	31.5	2.95	1.38	2.00	2.25	2.40	1.18	7.25	1.45	30.0	+555	
30.01	20:30	1656	
Westerlo : Cercle Brugge
3.60	3.60	1.98	1.77	1.25	6.00	3.20	2.13	1.68	2.70	1.59	1.96	2.70	1.82	5.50	2.85	+571	
31.01	18:45	1657	
Charleroi : Eupen
1.63	3.95	5.15	1.13	2.20	2.55	9.00	2.10	1.70	2.80	1.72	2.12	1.63	3.55	2.35	8.50	+568	
31.01	18:45	1658	
Oud Heverlee : Genk
4.70	4.00	1.65	2.14	1.15	8.25	2.60	2.40	1.55	2.40	1.57	1.87	2.95	1.55	7.00	2.25	+572	
31.01	21:00	1662	
Union St. Gilloise : RWD Molenbeek
1.20	6.00	12.3	-	4.05	1.67	21.0	2.75	1.40	2.05	1.88	2.16	1.23	5.35	1.54	19.8	+561	
31.01	21:00	1664	
Standard : Antwerp
3.90	3.50	1.93	1.82	1.22	6.75	3.10	1.92	1.83	3.15	1.72	2.18	3.15	1.90	6.50	2.95	+569	
01.02	20:30	2846	
Mechelen : Anderlecht
3.50	3.35	2.10	1.68	1.27	6.00	3.50	1.83	1.93	3.40	1.74	2.25	3.00	2.09	6.00	3.35	+569	
01.02	20:30	2847	
St. Truiden : Gent
3.60	3.45	2.00	1.74	1.25	6.25	3.30	1.89	1.87	3.20	1.72	2.20	3.05	1.99	6.00	3.15	+569	
ITALY SERIE A	Конечен Тип	Двојна шанса	Полувреме/крај	Вкупно голови	ГГ/НГ Комб.	Тим	Комбинации	
Датум	Време	Код	
Натпревар
1	X	2	1X	X2	1-1	2-2	0-2	3+	4+	ГГ	ГГ и 3+	T1 2+	T2 2+	1 & 3+	2 & 3+	
Таб
04.02	20:45	3001	
Inter : Juventus
1.85	3.30	4.70	1.17	1.91	3.05	8.25	1.65	2.23	4.15	2.03	2.80	2.10	4.35	3.30	9.50	+567	
ТИКЕТ
TИКЕТИ СО КОД
Ве молиме изберете типови.

...
КОНТАКТ
Sport Life обложувалници
Спорт-Лаиф Трејд ДОО Скопје
Бул. „Борис Трајковски“ бр. 198 Скопје
Телефон: +389 77 728 333
Факс: + 389 2 2774 193
Поддршка: support@sportlife.com.mk
НАВИГАЦИЈА
Почетна
Обложување
Резултати
Андроид апликација
Правила
За нас
Односи со јавност
Aрхива

Sport Life ©2003-2020 сите права се задржани
ОДГОВОРНА ИГРА |
 
КОНТАКТ</textarea>
                                <button class="btn btn-sm w-100" style="background-color: #9c27b0;" id="convert">Extract Data</button>
                            </div>
                        </div>
                    </div>            
                </div>
            </div>
        </div>
    </div>
  </div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.js"></script>

{{-- Basketball script --}}
<script>
    $(function(){
        // Calling the curent day on self input js from " dt.js "
        $('#convert').on('click', ()=> {
            let data = extractData()
        })
    })

    function extractData() {
        let textArea = document.getElementById('football').value

        // Explode by line
        let arr  = textArea.split('\n')

        // Starting index of bets
        arr = arr.slice(arr.indexOf('Таб') + 1, arr.indexOf('TИКЕТИ СО КОД')-1)
        // console.log(arr.indexOf('Таб')-4)

        let tabIndexes = [];
        for (let index = 0; index < arr.length; index++) {
            if (arr[index] == 'Таб') {
                tabIndexes.push(index)
            }        
        }

        let previousIndex = 0
        let dataSplit = []
        for (let index = 0; index < tabIndexes.length; index++) {
            let chank
            if (previousIndex == 0) {
                chank = arr.slice(previousIndex, tabIndexes[index] - 4)
            } else {
                chank = arr.slice(previousIndex + 1, tabIndexes[index] - 4)
            }
            previousIndex = tabIndexes[index]
            dataSplit.push(chank)
        }
        dataSplit.push(arr.slice(previousIndex + 1, arr.length))
        console.log(dataSplit)
        dataMerger(dataSplit)
    }

    function dataMerger(dataSplit) {
        let teamAndCoef = []
        for (let i = 0; i < dataSplit.length; i += 3) {
            for (let j = 3; j < dataSplit[i].length; j += 3) {
                let match = [dataSplit[i][j-2], dataSplit[i][j-1]]
                teamAndCoef.push(match)            
            }
        }
        console.log(teamAndCoef)
        let data = []
        for (let i = 0; i < teamAndCoef.length; i++) {
            let teams = teamAndCoef[i][0].split(":")
            let coef = teamAndCoef[i][1].split('\t')

            let obj = {
                'team1' : teams[0].trim(),
                'team2' : teams[1].trim(),
                '1' : coef[0],
                'X' : coef[1],
                '2' : coef[2],
                '1X' : coef[3],
                'X2' : coef[4],
                '1-1' : coef[5],
                '2-2' : coef[6],
                '0-2' : coef[7],
                '3+' : coef[8],
                '4+' : coef[9],
                'ГГ' : coef[10],
                'ГГ и 3+' :  coef[11],
                'T1 2+' :  coef[12],
                'T2 2+' :  coef[13],
                '1 & 3+' :  coef[14],
                '2 & 3+' :  coef[15]
            }

            data.push(obj)
        }

        console.log(data)
    }

    async function jsFootball(onlyResults, le, dateShow) {
            let footballResults = [];
            
            // Lenght on rows to insert
            for (let q = 0; q < le; q++) {
                let rowToArr = onlyResults[q]
                let rowArrRes = rowToArr.split('\t');

                if (rowArrRes[10] == 'Одложен') {
                    continue
                }

                // Split the result 69:69
                halft_time_result = rowArrRes[8].split(':')
                match_result = rowArrRes[9].split(':')

                let league = rowArrRes[2]
                let t1name = rowArrRes[3]
                let t2name = rowArrRes[7]
                let t1coef = rowArrRes[4]
                let t2coef = rowArrRes[6]
                let xcoef = rowArrRes[5]
                let t1total = match_result[0]
                let t2total = match_result[1]

                let t1halftime
                let t1ha2ftime
                if(halft_time_result[0].length < 2) {
                    t1halftime = "-1"
                    t2halftime = "-1"
                } else {
                    t1halftime = halft_time_result[0].replace('(', '').trim()
                    t2halftime = halft_time_result[1].replace(')', '').trim()
                }

                footballResults.push({
                    'league': league.trim(),
                    'xcoef': xcoef.trim(),
                    'team1': 
                        {
                            'name': t1name.trim(),
                            'coef': t1coef.trim(),
                            'half_time': t1halftime,
                            'total': t1total.trim()
                        },
                    'team2': 
                        {
                            'name': t2name.trim(),
                            'coef': t2coef.trim(),
                            'half_time': t2halftime,
                            'total': t2total.trim()
                        },
                    'match_date': dateShow,
                    'home_team': t1name.trim()
                })
            } 

            // Make array to string
            let jsonTeam = JSON.stringify((footballResults));
            jsonTeam = jsonTeam.replace('[','');
            jsonTeam = jsonTeam.replace(']','')
            $.ajax({
                type: "POST",
                dataType: "json",
                url: '{{ route("matchExportController.storeFootballTeam") }}',
                data: jsonTeam,
                    success: function (data) {
                        document.getElementById('football-team-update').innerHTML = '<i class="material-icons" style="color: green; font-weight: 800;">done</i>'
                        //  Data from controller get all model
                        let data_football_import = data.data.football_import
                        let data_id = data.data.id
                        let data_time_stamp = data.data.time_stamp

                        let time_stamp_collection = document.getElementsByClassName('time_stamp')
                        let index = 0;
                        let time_stamp = 0;

                        for (index; index < time_stamp_collection.length; index++) {
                            if (time_stamp_collection[index].innerText == data_time_stamp) {
                                time_stamp = time_stamp_collection[index].innerText;
                                break;
                            }
                        }

                        // // if timestamp data already exist replace column values
                        if (time_stamp == data_time_stamp) {
                            let fi = document.getElementsByClassName('football_import')[index]

                            fi.innerHTML = data_football_import ? '<i class="material-icons" style="color: green; font-weight: 800;">done</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>'
                        } else {
                            let newRow = document.getElementById('div-data')
                            let tr = document.createElement('tr')
                            tr.innerHTML = '<th scope="row" class="id">' + data.data.id + '</th><td class="time_stamp">' + data.data.time_stamp + '</td><td class="basket_import">' + (data.data.basket_import ? '<i class="material-icons" style="color: green; font-weight: 800;">done</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td><td class="player_import">' + (data.data.player_import ? '<i class="material-icons" style="color: green; font-weight: 800;">done</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td><td class="football_import">' + (data.data.football_import ? '<i class="material-icons" style="color: green; font-weight: 800;">done</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td><td class="basket_error">' + (data.data.basket_error ? '<i class="material-icons" style="color: red;">error</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td><td class="player_error">' + (data.data.player_error ? '<i class="material-icons" style="color: red;">error</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td><td class="football_error">' + (data.data.football_error ? '<i class="material-icons" style="color: red;">error</i>' : '<i class="material-icons" style="color: coral; font-weight: 800;">close</i>') + '</td>'
                            newRow.prepend(tr)
                        }

                        document.getElementById('football').value = ''
                        const Toast = Swal.mixin({
                            toast: true,
                            position: "top-end",
                            showConfirmButton: false,
                            timer: 3000,
                        });
                        Toast.fire({
                            title: "Football Team saved successfully"
                        });
                    },
                    error: function (xhr, ajaxOptions, thrownError) {
                        document.getElementById('football-team-update').innerHTML = '<i class="material-icons" style="color: red;">error</i>'
                        document.getElementById('football').value = ''
                        let ajaxerror = {
                            'xhr-exception' : xhr.responseJSON.exception,
                            'xhr-file' : xhr.responseJSON.file,
                            'xhr-line' : xhr.responseJSON.line,
                            'xhr-message' : xhr.responseJSON.message,
                            'ajaxOptions' : ajaxOptions,
                            'thrownError' : thrownError
                        }
                        let ajaxjsonError = JSON.stringify((ajaxerror));
                        $.ajax({
                            dataType: "json",
                            url: '{{ route("matchExportController.ajaxErrorDescription") }}',
                            data: ajaxjsonError,
                            type: "POST",
                            headers: {
                                'X-CSRF-Token': '{{ csrf_token() }}',
                            }
                        })
                    },
                headers: {
                    'X-CSRF-Token': '{{ csrf_token() }}',
                }
            });
    }
</script>

{{-- Include this script if there is delete button for sweet alert --}}
@include('layouts.actions.deleteJS')
@endsection